balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ64GS610.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="TRIG6" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="TRIG6" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGCMP" edc:desc="" edc:mask="0x1fff" edc:name="TRGCMP" edc:nzwidth="13"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TRGCMP0" edc:desc="" edc:mask="0x1" edc:name="TRGCMP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP1" edc:desc="" edc:mask="0x1" edc:name="TRGCMP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP2" edc:desc="" edc:mask="0x1" edc:name="TRGCMP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP3" edc:desc="" edc:mask="0x1" edc:name="TRGCMP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP4" edc:desc="" edc:mask="0x1" edc:name="TRGCMP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP5" edc:desc="" edc:mask="0x1" edc:name="TRGCMP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP6" edc:desc="" edc:mask="0x1" edc:name="TRGCMP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP7" edc:desc="" edc:mask="0x1" edc:name="TRGCMP7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP8" edc:desc="" edc:mask="0x1" edc:name="TRGCMP8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP9" edc:desc="" edc:mask="0x1" edc:name="TRGCMP9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP10" edc:desc="" edc:mask="0x1" edc:name="TRGCMP10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP11" edc:desc="" edc:mask="0x1" edc:name="TRGCMP11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGCMP12" edc:desc="" edc:mask="0x1" edc:name="TRGCMP12" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----n-nnnnnn" edc:cname="TRGCON6" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----0-000000" edc:name="TRGCON6" edc:nzwidth="0x10" edc:por="0000----0-000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRGSTRT" edc:desc="" edc:mask="0x3f" edc:name="TRGSTRT" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DTM" edc:desc="" edc:mask="0x1" edc:name="DTM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRGDIV" edc:desc="" edc:mask="0xf" edc:name="TRGDIV" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TRGSTRT0" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT1" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT2" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT3" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT4" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGSTRT5" edc:desc="" edc:mask="0x1" edc:name="TRGSTRT5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="TRGDIV0" edc:desc="" edc:mask="0x1" edc:name="TRGDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV1" edc:desc="" edc:mask="0x1" edc:name="TRGDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV2" edc:desc="" edc:mask="0x1" edc:name="TRGDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRGDIV3" edc:desc="" edc:mask="0x1" edc:name="TRGDIV3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="STRIG6" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------" edc:name="STRIG6" edc:nzwidth="16" edc:por="----------------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="STRGCMP" edc:desc="" edc:mask="0x1fff" edc:name="STRGCMP" edc:nzwidth="13"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="STRGCMP0" edc:desc="" edc:mask="0x1" edc:name="STRGCMP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP1" edc:desc="" edc:mask="0x1" edc:name="STRGCMP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP2" edc:desc="" edc:mask="0x1" edc:name="STRGCMP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP3" edc:desc="" edc:mask="0x1" edc:name="STRGCMP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP4" edc:desc="" edc:mask="0x1" edc:name="STRGCMP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP5" edc:desc="" edc:mask="0x1" edc:name="STRGCMP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP6" edc:desc="" edc:mask="0x1" edc:name="STRGCMP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP7" edc:desc="" edc:mask="0x1" edc:name="STRGCMP7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP8" edc:desc="" edc:mask="0x1" edc:name="STRGCMP8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP9" edc:desc="" edc:mask="0x1" edc:name="STRGCMP9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP10" edc:desc="" edc:mask="0x1" edc:name="STRGCMP10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP11" edc:desc="" edc:mask="0x1" edc:name="STRGCMP11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRGCMP12" edc:desc="" edc:mask="0x1" edc:name="STRGCMP12" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="PWMCAP6" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="PWMCAP6" edc:nzwidth="0x10" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="PWMCAP6" edc:desc="" edc:islanghidden="true" edc:mask="0x1fff" edc:name="PWMCAP6" edc:nzwidth="0xd"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn----nnnnnn" edc:cname="LEBCON6" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000----000000" edc:name="LEBCON6" edc:nzwidth="0x10" edc:por="000000----000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BPLL" edc:desc="" edc:mask="0x1" edc:name="BPLL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPLH" edc:desc="" edc:mask="0x1" edc:name="BPLH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPHL" edc:desc="" edc:mask="0x1" edc:name="BPHL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BPHH" edc:desc="" edc:mask="0x1" edc:name="BPHH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCL" edc:desc="" edc:mask="0x1" edc:name="BCL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCH" edc:desc="" edc:mask="0x1" edc:name="BCH" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CLLEBEN" edc:desc="" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:desc="" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLF" edc:desc="" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLR" edc:desc="" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnn---" edc:cname="LEBDLY6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000---" edc:name="LEBDLY6" edc:nzwidth="16" edc:por="-----00000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB" edc:desc="" edc:mask="0xff" edc:name="LEB" edc:nzwidth="9"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB0" edc:desc="" edc:mask="0x1" edc:name="LEB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB1" edc:desc="" edc:mask="0x1" edc:name="LEB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB2" edc:desc="" edc:mask="0x1" edc:name="LEB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB3" edc:desc="" edc:mask="0x1" edc:name="LEB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB4" edc:desc="" edc:mask="0x1" edc:name="LEB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB5" edc:desc="" edc:mask="0x1" edc:name="LEB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB6" edc:desc="" edc:mask="0x1" edc:name="LEB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB7" edc:desc="" edc:mask="0x1" edc:name="LEB7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB8" edc:desc="" edc:mask="0x1" edc:name="LEB8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
